In [1]:
values = [1,2,3,4,5,6,7,8,9,10]
evens=[] #extracting even values

In [3]:
#Solution 1 - list iterate, test & append
for value in values:
    if value % 2 == 0:
        evens.append(value)
evens

[2, 4, 6, 8, 10]

In [26]:
import pandas as pd
cars = { 'brand': ['Toyota','Mercedes'],
          'sold': [125,45] }
#load data into a DataFrame object:
df1 = pd.DataFrame(cars, index=[1,2])
df1

      brand  sold
1    Toyota   125
2  Mercedes    45

In [28]:
new = { 'brand': ['Ford'], 'sold': [250] }
df2 = pd.DataFrame(new, index=[3])
df2

  brand  sold
3  Ford   250

In [30]:
df=df1.append(df2)
df

C:\Users\User\AppData\Local\Temp\ipykernel_24528\2613126780.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df=df1.append(df2)

      brand  sold
1    Toyota   125
2  Mercedes    45
3      Ford   250

In [31]:
df=pd.concat([df1,df2])
df

      brand  sold
1    Toyota   125
2  Mercedes    45
3      Ford   250

In [34]:
#Solution 2 - using filter
evens=list(filter(lambda x: x % 2 == 0, values))
evens

[2, 4, 6, 8, 10]

In [38]:
#Applying filter to list of dictionaries
ages = [
    {'name': 'Evan', 'age': 51},
    {'name': 'John', 'age': 45},
    {'name': 'Jane', 'age': 49},
    {'name': 'Jack', 'age': 47},
    {'name': 'Jill'}
]
filtered=list(filter(lambda x: x.get('age',0) > 47, ages))
filtered

[{'name': 'Evan', 'age': 51}, {'name': 'Jane', 'age': 49}]

In [41]:
#Applying filter to list of tuples
sales = [
    ('2023-07-25', 125),
    ('2023-07-26', 145),
    ('2023-07-27', 180),
    ('2023-07-28', 225),
    ('2023-07-31', 150)    
]
filtered=list(filter(lambda x: x[1] > 150, sales))
filtered

[('2023-07-27', 180), ('2023-07-28', 225)]

In [42]:
countries=['Ireland','Austria','','France','','Germany']
cleaned=list(filter(None, countries))
cleaned

['Ireland', 'Austria', 'France', 'Germany']